## 파이썬에서 텍스트 파일과 엑셀 파일 읽기 - pandas

In [3]:
import pandas as pd

In [4]:
CCTV_Seoul = pd.read_csv('./CCTV_in_Seoul.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [6]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [7]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [10]:
pop_Seoul = pd.read_excel('./population_in_Seoul.xls', 
                          header=2,
                          usecols='B,D,G,J,N',
                          encoding='utf-8')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [12]:
pop_Seoul.rename(columns={pop_Seoul.columns[0]: '구별',
                         pop_Seoul.columns[1]: '인구수',
                         pop_Seoul.columns[2]: '한국인',
                         pop_Seoul.columns[3]: '외국인',
                         pop_Seoul.columns[4]: '고령자'}, inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

## pandas 기초 익히기

In [13]:
import pandas as pd
import numpy as np

In [14]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [16]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01  0.626604  0.138220  0.419880 -0.569445
2013-01-02 -1.209989  1.594215  0.498768  0.764942
2013-01-03  0.379501  1.162510  0.832000  0.672270
2013-01-04 -1.486370  1.247527 -0.540424  0.638685
2013-01-05 -0.244198  1.008867  1.591396 -0.392691
2013-01-06 -0.017007 -0.345866 -1.457341  0.982281

In [18]:
df.head(3)

                   A         B         C         D
2013-01-01  0.626604  0.138220  0.419880 -0.569445
2013-01-02 -1.209989  1.594215  0.498768  0.764942
2013-01-03  0.379501  1.162510  0.832000  0.672270

In [19]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [21]:
df.values

array([[ 0.62660361,  0.13822007,  0.41987963, -0.56944531],
       [-1.20998862,  1.59421477,  0.49876812,  0.76494227],
       [ 0.37950071,  1.16251038,  0.83200038,  0.67226986],
       [-1.48636996,  1.24752701, -0.54042399,  0.63868497],
       [-0.24419828,  1.00886691,  1.59139633, -0.39269117],
       [-0.01700657, -0.34586592, -1.4573408 ,  0.98228119]])

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [23]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.325243  0.800912  0.224047  0.349340
std    0.852672  0.742570  1.073737  0.656677
min   -1.486370 -0.345866 -1.457341 -0.569445
25%   -0.968541  0.355882 -0.300348 -0.134847
50%   -0.130602  1.085689  0.459324  0.655477
75%    0.280374  1.226273  0.748692  0.741774
max    0.626604  1.594215  1.591396  0.982281

In [27]:
df.sort_values(by='B', ascending=False)
df

                   A         B         C         D
2013-01-01  0.626604  0.138220  0.419880 -0.569445
2013-01-02 -1.209989  1.594215  0.498768  0.764942
2013-01-03  0.379501  1.162510  0.832000  0.672270
2013-01-04 -1.486370  1.247527 -0.540424  0.638685
2013-01-05 -0.244198  1.008867  1.591396 -0.392691
2013-01-06 -0.017007 -0.345866 -1.457341  0.982281

In [28]:
df['A']

2013-01-01    0.626604
2013-01-02   -1.209989
2013-01-03    0.379501
2013-01-04   -1.486370
2013-01-05   -0.244198
2013-01-06   -0.017007
Freq: D, Name: A, dtype: float64

In [29]:
df[0:3]

                   A         B         C         D
2013-01-01  0.626604  0.138220  0.419880 -0.569445
2013-01-02 -1.209989  1.594215  0.498768  0.764942
2013-01-03  0.379501  1.162510  0.832000  0.672270

In [30]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.209989  1.594215  0.498768  0.764942
2013-01-03  0.379501  1.162510  0.832000  0.672270
2013-01-04 -1.486370  1.247527 -0.540424  0.638685

In [31]:
df.loc[dates[0]]

A    0.626604
B    0.138220
C    0.419880
D   -0.569445
Name: 2013-01-01 00:00:00, dtype: float64

In [32]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.626604  0.138220
2013-01-02 -1.209989  1.594215
2013-01-03  0.379501  1.162510
2013-01-04 -1.486370  1.247527
2013-01-05 -0.244198  1.008867
2013-01-06 -0.017007 -0.345866

In [33]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.209989  1.594215
2013-01-03  0.379501  1.162510
2013-01-04 -1.486370  1.247527

In [34]:
df.loc['20130102',['A','B']]

A   -1.209989
B    1.594215
Name: 2013-01-02 00:00:00, dtype: float64

In [35]:
df.loc[dates[0], 'A']

0.6266036128537426

In [36]:
df.iloc[3]

A   -1.486370
B    1.247527
C   -0.540424
D    0.638685
Name: 2013-01-04 00:00:00, dtype: float64

In [37]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.486370  1.247527
2013-01-05 -0.244198  1.008867

In [38]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.209989  0.498768
2013-01-03  0.379501  0.832000
2013-01-05 -0.244198  1.591396

In [39]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.209989  1.594215  0.498768  0.764942
2013-01-03  0.379501  1.162510  0.832000  0.672270

In [40]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.138220  0.419880
2013-01-02  1.594215  0.498768
2013-01-03  1.162510  0.832000
2013-01-04  1.247527 -0.540424
2013-01-05  1.008867  1.591396
2013-01-06 -0.345866 -1.457341

In [41]:
df

                   A         B         C         D
2013-01-01  0.626604  0.138220  0.419880 -0.569445
2013-01-02 -1.209989  1.594215  0.498768  0.764942
2013-01-03  0.379501  1.162510  0.832000  0.672270
2013-01-04 -1.486370  1.247527 -0.540424  0.638685
2013-01-05 -0.244198  1.008867  1.591396 -0.392691
2013-01-06 -0.017007 -0.345866 -1.457341  0.982281

In [42]:
df[df.A > 0]

                   A        B        C         D
2013-01-01  0.626604  0.13822  0.41988 -0.569445
2013-01-03  0.379501  1.16251  0.83200  0.672270

In [43]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.626604  0.138220  0.419880       NaN
2013-01-02       NaN  1.594215  0.498768  0.764942
2013-01-03  0.379501  1.162510  0.832000  0.672270
2013-01-04       NaN  1.247527       NaN  0.638685
2013-01-05       NaN  1.008867  1.591396       NaN
2013-01-06       NaN       NaN       NaN  0.982281

In [45]:
df2 = df.copy()

In [46]:
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.626604  0.138220  0.419880 -0.569445    one
2013-01-02 -1.209989  1.594215  0.498768  0.764942    one
2013-01-03  0.379501  1.162510  0.832000  0.672270    two
2013-01-04 -1.486370  1.247527 -0.540424  0.638685  three
2013-01-05 -0.244198  1.008867  1.591396 -0.392691   four
2013-01-06 -0.017007 -0.345866 -1.457341  0.982281  three

In [50]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [51]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.379501  1.162510  0.832000  0.672270   two
2013-01-05 -0.244198  1.008867  1.591396 -0.392691  four

In [52]:
df

                   A         B         C         D
2013-01-01  0.626604  0.138220  0.419880 -0.569445
2013-01-02 -1.209989  1.594215  0.498768  0.764942
2013-01-03  0.379501  1.162510  0.832000  0.672270
2013-01-04 -1.486370  1.247527 -0.540424  0.638685
2013-01-05 -0.244198  1.008867  1.591396 -0.392691
2013-01-06 -0.017007 -0.345866 -1.457341  0.982281

In [53]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.626604  0.138220  0.419880 -0.569445
2013-01-02 -0.583385  1.732435  0.918648  0.195497
2013-01-03 -0.203884  2.894945  1.750648  0.867767
2013-01-04 -1.690254  4.142472  1.210224  1.506452
2013-01-05 -1.934453  5.151339  2.801620  1.113761
2013-01-06 -1.951459  4.805473  1.344280  2.096042

In [54]:
df.apply(lambda x: x.max() - x.min())

A    2.112974
B    1.940081
C    3.048737
D    1.551726
dtype: float64